/************************************************************************/
/* 名称：TD数据,用595传递数据
 * 描述：
 * 编写：邹应龙
 * 修改：2015-07-04
 * 缘由：舒华5517*/
/************************************************************************/
#include "../main.h"


/************************************************************************/
/* 功能：
 * 描述：数组前面的数据先传入，下标大的数据后传入
 * 形参：
 * 返回：无    */
/************************************************************************/
void hc595_out(u8 *data, s8 n)
{
	s8 i,j,byte;
  	SH_CP_L;
  	ST_CP_L;
  	for(i=0; i<n; i++)
  	{
		byte = data[i];
	  	for(j=0; j<8; j++)
	  	{
		  	if(byte&0x80)		DS_H;			//先输出的是高位
		  	else 				DS_L;
		  	byte<<=1;
		  		
		  	SH_CP_H;
		  	SH_CP_L;
	  	}
  	}
  	ST_CP_H;			//输出	
}

void td62783_clear(void)
{
	u8 data[2] = {0,0};
	hc595_out(data,2);
}
void td62783_out(u16 td)
{
	u8 data[2];
	data[1] = (u8)td;
	data[0] = (u8)(td>>8);
	hc595_out(data,2);
}